{
  "Troubleshooting Steps": [
    "Verify the node's IP address falls within the RemoteNodeNetwork CIDR blocks configured for the cluster",
    "Check if the Hybrid Nodes IAM role has the required permissions including eks:DescribeCluster",
    "Verify that AWS SSM activation code and ID are correct in nodeConfig.yaml",
    "Check if SSM activation has expired (they expire after 24 hours by default) with 'aws ssm describe-activations' to list all activations or 'aws ssm describe-activations --filters \"Key=ActivationIds,Values=[your-activation-id]\"' for a specific activation.",
    "If using IAM Roles Anywhere, verify certificate and private key paths are correct with 'aws rolesanywhere list-trust-anchors' to view all trust anchors or 'aws rolesanywhere get-trust-anchor --trust-anchor-id <id>' for a specific one. Check profile configuration with 'aws rolesanywhere list-profiles' or 'aws rolesanywhere get-profile --profile-id <id>'. Ensure your certificate matches the requirements specified in the trust anchor (certificate type, CA path) and that your profile correctly maps to the required IAM role",
    "Test credential access with 'sudo aws sts get-caller-identity' on the node",
    "Ensure aws-auth ConfigMap in kube-system namespace correctly maps the Hybrid Nodes IAM role to system:node:{{SessionName}} with 'kubectl get configmap aws-auth -n kube-system -o yaml'. Verify the mapRoles section contains an entry with rolearn matching your hybrid node IAM role, username format system:node:{{SessionName}}, and groups including both system:bootstrappers and system:nodes",
    "Check DNS resolution for the EKS API server endpoint on the hybrid node",
    "Examine kubelet systemd unit file configuration to ensure proper startup parameters",
    "Verify kubelet is configured with the correct cluster endpoint in bootstrap configuration",
    "Check kubelet logs with 'journalctl -u kubelet' for TLS handshake failures or API server connectivity issues",
    "Ensure kubelet has appropriate CA certificates to validate the API server's certificate",
    "Restart the nodeadm process with 'nodeadm uninstall' followed by 'nodeadm install' and 'nodeadm init'"
  ],
  "description": "Hybrid nodes fail to register with the Amazon EKS cluster and don't appear in the node inventory. This typically occurs due to credential issues, network connectivity problems, CIDR mismatches, or RBAC configuration errors. The node registration process requires proper IAM permissions, network connectivity to the EKS API server, and correct Kubernetes RBAC mappings.",
  "symptoms": [
    "Node does not appear in 'kubectl get nodes' output",
    "Error 'node IP X.X.X.X is not in any of the remote network CIDR blocks' in logs",
    "SSM activation expired errors in node logs",
    "Certificate validation errors during registration",
    "Unauthorized or permission denied errors in bootstrap logs",
    "DNS resolution failure for the EKS API endpoint",
    "Failed to register the instance with AWS SSM",
    "ExpiredTokenException in logs",
    "Kubelet bootstrap TLS handshake failures in logs",
    "'Unable to register node with API server' errors in kubelet logs",
    "Certificate verification errors when connecting to the API server",
    "Node bootstrap token authentication failures"
  ],
  "references": [
    "https://docs.aws.amazon.com/eks/latest/userguide/hybrid-nodes-networking.html",
    "https://docs.aws.amazon.com/eks/latest/userguide/hybrid-nodes-creds.html",
    "https://docs.aws.amazon.com/eks/latest/userguide/hybrid-nodes-cluster-prep.html"
  ]
}
