{
  "Troubleshooting Steps": [
    "Verify that subnets have sufficient free IP addresses for EKS network interfaces - each subnet must have at least 6 free IP addresses (16 recommended) for the cluster network interfaces that enable communication between your cluster and VPC. Check available IPs using the 'get_eks_vpc_config' tool",
    "Ensure subnets are distributed across at least 2 different Availability Zones and avoid disallowed AZs (us-east-1/use1-az3, us-west-1/usw1-az2, ca-central-1/cac1-az3) as EKS cannot create network interfaces in these zones",
    "Verify node and pod CIDRs meet all requirements: (1) Node CIDR must be allocated from your on-premises network and pod CIDR from your CNI if using an overlay network, (2) Both are specified when creating the EKS cluster using RemoteNodeNetwork and RemotePodNetwork fields, (3) Must be within IPv4 RFC-1918 ranges (10.0.0.0/8, 172.16.0.0/12, or 192.168.0.0/16), (4) Cannot overlap with each other, the VPC CIDR for your EKS cluster, or your Kubernetes service IPv4 CIDR, (5) On-premises node CIDRs must be routable on your on-premises network",
    "Verify the Hybrid Nodes IAM role has all required permissions: (1) eks:DescribeCluster for nodeadm to gather cluster info, (2) Amazon ECR permissions via AmazonEC2ContainerRegistryPullOnly policy for kubelet image access, (3) If using AWS SSM, permissions from AmazonSSMManagedInstanceCore policy plus ssm:DeregisterManagedInstance and ssm:DescribeInstanceInformation for nodeadm, (4) Optional eks-auth:AssumeRoleForPodIdentity for EKS Pod Identity Agent. Ensure this role is mapped to Kubernetes RBAC via EKS access entry or aws-auth ConfigMap",
    "For AWS SSM authentication: Verify that activation code and ID are correct in nodeConfig.yaml and check if activation has expired (they expire after 24 hours by default) using 'aws ssm describe-activations' to list all activations or 'aws ssm describe-activations --filters \"Key=ActivationIds,Values=[your-activation-id]\"' for a specific activation",
    "If using IAM Roles Anywhere, verify certificate and private key paths are correct with 'aws rolesanywhere list-trust-anchors' to view all trust anchors or 'aws rolesanywhere get-trust-anchor --trust-anchor-id <id>' for a specific one. Check profile configuration with 'aws rolesanywhere list-profiles' or 'aws rolesanywhere get-profile --profile-id <id>'. Ensure your certificate matches the requirements specified in the trust anchor (certificate type, CA path) and that your profile correctly maps to the required IAM role",
    "Test credential access with 'sudo aws sts get-caller-identity' on the node",
    "Ensure aws-auth ConfigMap in kube-system namespace correctly maps the Hybrid Nodes IAM role to system:node:{{SessionName}} with 'kubectl get configmap aws-auth -n kube-system -o yaml'. Verify the mapRoles section contains an entry with rolearn matching your hybrid node IAM role, username format system:node:{{SessionName}}, and groups including both system:bootstrappers and system:nodes",
    "Check DNS resolution for the EKS API server endpoint on the hybrid node using the 'get_eks_dns_status' tool",
    "Examine kubelet systemd unit file configuration to ensure proper startup parameters",
    "Verify kubelet is configured with the correct cluster endpoint in bootstrap configuration",
    "Check kubelet logs with 'journalctl -u kubelet' for TLS handshake failures or API server connectivity issues",
    "Ensure kubelet has appropriate CA certificates to validate the API server's certificate",
    "Restart the nodeadm process with 'nodeadm uninstall' followed by 'nodeadm install' and 'nodeadm init'"
  ],
  "description": "Hybrid nodes fail to register with the Amazon EKS cluster and don't appear in the node inventory. This typically occurs due to credential issues, network connectivity problems, CIDR mismatches, or RBAC configuration errors. The node registration process requires proper IAM permissions, network connectivity to the EKS API server, and correct Kubernetes RBAC mappings.",
  "symptoms": [
    "'Insufficient free address' errors in EKS control plane logs",
    "Subnet capacity warnings during node registration",
    "Unable to create elastic network interfaces in specified subnets",
    "Node does not appear in 'kubectl get nodes' output",
    "Error 'node IP X.X.X.X is not in any of the remote network CIDR blocks' in logs",
    "SSM activation expired errors in node logs",
    "Certificate validation errors during registration",
    "Unauthorized or permission denied errors in bootstrap logs",
    "DNS resolution failure for the EKS API endpoint",
    "Failed to register the instance with AWS SSM",
    "ExpiredTokenException in logs",
    "Kubelet bootstrap TLS handshake failures in logs",
    "'Unable to register node with API server' errors in kubelet logs",
    "Certificate verification errors when connecting to the API server",
    "Node bootstrap token authentication failures"
  ],
  "references": [
    "https://docs.aws.amazon.com/eks/latest/userguide/hybrid-nodes-networking.html",
    "https://docs.aws.amazon.com/eks/latest/userguide/hybrid-nodes-creds.html",
    "https://docs.aws.amazon.com/eks/latest/userguide/hybrid-nodes-cluster-prep.html"
  ]
}
